Revit 2026 API

# SlantedOrVerticalColumnType Enumeration

---

This enum class is used for the BuiltInParameter SLANTED_COLUMN_TYPE_PARAM.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SlantedOrVerticalColumnType
```
```vb
Public Enumeration SlantedOrVerticalColumnType
```
```cpp
public enum class SlantedOrVerticalColumnType
```
```fsharp
type SlantedOrVerticalColumnType
```

| Member name | Value | Description |
| --- | --- | --- |
| CT_Angle | 1 |  |
| CT_EndPoint | 2 |  |
| CT_Vertical | 0 |  |

#### Reference

Autodesk.Revit.DB Namespace